ZigEmbeddedGroup/texasinstruments-data/targetdb/Modules/msp/mspm33c321x/WUC_1.0.xml
<?xml version="1.0" encoding="UTF-8"?>
<module id="WUC" HW_revision="1.0">
    <register id="WUC_FSUB_0" width="32" offset="0x400" description="Subscriber Port 0">
        <bitfield id="CHANID" description="0 = disconnected.
1-15 = connected to channelID = CHANID." begin="8" end="0" width="9" rwaccess="R/W">
            <bitenum id="MNIMUM" value="0x0" description="0 is an allowed value, signifying that the event is unconnected"/>
            <bitenum id="UNCONNECTED" value="0x0" description="A value of 0 specifies that the event is not connected"/>
            <bitenum id="MAXIMUM" value="0xF" description="Consult your device datasheet as the actual allowed maximum may be less than 15."/>
        </bitfield>
    </register>
    <register id="WUC_FSUB_1" width="32" offset="0x404" description="Subscriber Port 1">
        <bitfield id="CHANID" description="0 = disconnected.
1-15 = connected to channelID = CHANID." begin="8" end="0" width="9" rwaccess="R/W">
            <bitenum id="MNIMUM" value="0x0" description="0 is an allowed value, signifying that the event is unconnected"/>
            <bitenum id="UNCONNECTED" value="0x0" description="A value of 0 specifies that the event is not connected"/>
            <bitenum id="MAXIMUM" value="0xF" description="Consult your device datasheet as the actual allowed maximum may be less than15."/>
        </bitfield>
    </register>

</module>